Repository: DIKO-Doc/DIKO-Doc.github.io
Catalog: cht-to-eng/cht-to-eng-omegat.tmx
Source language: zh_tw
Languages: en

source: passing argument %d of %qE makes pointer from integer without a cast
en: 傳遞參數 %d (屬於 %qE)時將整數賦給指標，未作類型轉換

source: passing argument %d of %qE with different width due to prototype
en: 根據原型，引數 %d (%qE) 將以不同的寬度傳遞

source: passing floating point arguments in fp regs not yet supported
en: 尚不支援在浮點暫存器中傳遞浮點參數

source: password is not supported when certificate is not on a PKCS#11 token
en: 證書不在PKCS＃11令牌上時，不支持密碼

source: path is not absolute (%s)
en: 路徑不是絕對的（%s)

source: pattern
en: 式樣

source: pch_preprocess pragma should only be used with -fpreprocessed
en: pch_preprocess pragma 只應與 -fpreprocessed 並用

source: pex_init failed
en: pex_init 失敗

source: plugin missing
en: 插件丟失

source: pointer arithmetic for garbage-collected objects not allowed
en: 不允許在被無用收集的物件上進行指標算術運算

source: pointer assignment
en: 指標賦值

source: pointer of type %<void *%> used in arithmetic
en: %<void *%> 型指標用在了算術運算式中

source: pointer of type %<void *%> used in subtraction
en: 在減法中使用類型為 %<void *%> 的指標

source: pointer targets in assignment differ in signedness
en: 對指標賦值時目的與指標有/無號不一致

source: pointer targets in initialization differ in signedness
en: 初始化指標時目的與指標有/無號不一致

source: pointer targets in passing argument %d of %qE differ in signedness
en: 傳遞參數 %d (屬於 %qE) 給指標時目的與指標有/無號不一致

source: pointer targets in return differ in signedness
en: 回傳指標時目的與指標有/無號不一致

source: pointer to a function used in arithmetic
en: 在算術運算式中使用了函式指標

source: pointer to a function used in subtraction
en: 函式指標不能相減

source: pointer to member conversion via virtual base %qT
en: 成員指標轉換經由虛基礎類別 %qT

source: pointer type mismatch in conditional expression
en: 條件運算式指標類型不匹配

source: pointer value used where a complex was expected
en: 需要複數時使用了指標值

source: pointer value used where a floating point value was expected
en: 需要浮點數值時使用了指標值

source: pointer-to-member function %E cannot be called without an object; consider using .* or ->*
en: 沒有物件不能呼叫成員函式指標 %E，考慮使用 .* 或 ->*

source: pointer/integer type mismatch in conditional expression
en: 條件運算式中指標/整數類型不匹配

source: pointers are not permitted as case values
en: 指標不能做為 case 常數

source: port
en: 接埠

source: portal
en: 入口網站

source: post-increment address is not a register
en: 後自增位址不是一個暫存器

source: postfix %qD must take %<int%> as its argument
en: 字尾 %qD 必須使用 %<int%> 做為它的參數

source: postfix %qD must take %<int%> as its second argument
en: 字尾 %qD 必須使用 %<int%> 做為它的第二個參數

source: postfix %qD should return %qT
en: 字尾 %qD 應當回傳 %qT

source: pre-decrement address is not a register
en: 前自減位址不是一個暫存器

source: pre-increment address is not a register
en: 前自增位址不是一個暫存器

source: precision
en: 精度

source: precision in printf format
en: printf 格式的精度

source: predicated Thumb instruction
en: 預測到的 Thumb 指令

source: prefix %qD should return %qT
en: 字首 %qD 應當回傳 %qT

source: preparing
en: 正在準備

source: prev_bb of %d should be %d, not %d
en: %d 的 prev_bb 應該為 %d，而不是 %d

source: previous declaration %q+#D here
en: 與此處早先的宣告 %q+#D 衝突

source: previous declaration %q+D
en: 先前的宣告 %q+D

source: previous declaration of %q+#D
en: %q+#D 的前一個宣告

source: previous declaration of %q+#D with %qL linkage
en: %q+#D 的早先宣告有 %qL 連結

source: previous declaration of %q+D was here
en: %q+D 的上一個宣告在此

source: previous declaration of %q+D with attribute noinline
en: 先前 %q+D 的宣告帶有 noinline 屬性

source: previous declaration of namespace %q+D here
en: 命名空間 %q+D 早先的宣告在這裡

source: previous definition of %q+D was here
en: %q+D 的上一個定義在此

source: previous implicit declaration of %q+D was here
en: %q+D 的上一個隱含宣告在此

source: previous non-function declaration %q+#D
en: 先前對於 %q+#D 的非函式宣告

source: print [all] :: print setting or connection values Shows current property or the whole connection. Example: nmcli ipv4> print all
en: print [all] :: 印出設定或是連線值 顯示目前的內容或是整個連線。 範例：nmcli ipv4> print all

source: print [property|setting|connection] :: print property (setting, connection) value(s) Shows property value. Providing an argument you can also display values for the whole setting or connection.
en: print [property|setting|connection] :: 印出內容（設定、連線）的值 顯示內容的值。提供一項引數，您亦可顯示整個設定或是連線的值。

source: profiler support for VxWorks
en: 對 VxWorks 的取樣支援

source: programs: %s
en: 程式：%s

source: promoted argument %qD doesn%'t match built-in prototype
en: 提升後的引數 %qD 與內建原型不符

source: promoted argument %qD doesn%'t match prototype
en: 提升後的引數 %qD 與原型不符

source: property '%s' of object class '%s' is not writable
en: 物業'%s' 對像類'%s' 是不可寫的

source: property cannot be set when dhcp-hostname is also set
en: 如果還設置了dhcp-hostname，則無法設置屬性

source: property invalid
en: 屬性不合規定

source: property invalid (not enabled)
en: 屬性不合規定（未啟用）

source: property is empty
en: 屬性為空

source: property is invalid
en: 屬性不合規定

source: property is missing
en: 找不到屬性

source: property is not specified
en: 屬性未指定

source: property is not specified and neither is '%s:%s'
en: 並未指定屬性，也不是 '%s:%s'

source: property missing
en: 找不到屬性

source: property must contain only digits
en: 屬性必須只包含數字

source: property should be TRUE when method is set to disabled
en: 當方法設置為禁用時，屬性應為TRUE

source: property should be TRUE when method is set to ignore
en: 當method設置為ignore時，property應為TRUE

source: property type should be set to '%s'
en: 屬性類型應設置為'%s'

source: property value '%s' is empty or too long (>64)
en: 屬性值 '%s' 是空的，或太長（>64）

source: prototype for %q#D does not match any in class %qT
en: %q#D 的原型不匹配類別 %qT 中的任何一個

source: prototype for %q+D declares argument %d with incompatible type
en: %q+D 的原型對引數 %d 宣告類型不相容

source: prototype for %q+D declares fewer arguments than previous old-style definition
en: %q+D 的原型宣告的參數少於先前舊式的定義

source: prototype for %q+D declares more arguments than previous old-style definition
en: %q+D 的原型宣告的參數多於先前舊式的定義

source: prototype for %q+D follows non-prototype definition
en: %q+D 的原型出現在非原型定義之後

source: provided for %q+D
en: 提供給 %q+D

source: qualified type %qT does not match destructor name ~%qT
en: 限定的類型 %qT 不匹配解構函式名 ~%qT

source: qualifiers are not allowed on declaration of %<operator %T%>
en: %<operator %T%> 的宣告中不能使用限定符

source: quit :: exit nmcli This command exits nmcli. When the connection being edited is not saved, the user is asked to confirm the action.
en: quit :: 退出 nmcli 這項指令會退出 nmcli。當被編輯的連線尚未儲存時，使用者會被要求確認動作。

source: range expressions in switch statements are non-standard
en: 在 switch 敘述中使用範圍運算式不符合標準

source: read-only member %qD used as %<asm%> output
en: 唯讀成員 %qD 做為 %<asm%> 的輸出

source: reading class %s for the second time from %s
en: 第二次讀取類別 %s，從 %s

source: reading through null pointer (argument %d)
en: 對空指標參照內容的讀作業(引數 %d)

source: recursive inlining
en: 遞迴內聯

source: recursive type %qT undefined
en: 遞迴的類型 %qT 未定義

source: redeclaration of %<enum %E%>
en: %<enum %E%> 重宣告

source: redeclaration of %<wchar_t%> as %qT
en: %<wchar_t%> 重宣告為 %qT

source: redeclaration of %q+D with different visibility (old visibility preserved)
en: 對 %q+D 的再次宣告中指定了不同的可見性 (保留原有的可見性)

source: redeclaration of %q+D with no linkage
en: %q+D 重宣告為沒有外部連結

source: redeclaration of %qT as a non-template
en: %qT 重宣告為非範本

source: redeclaration of enumerator %q+D
en: 列舉 %q+D 重宣告

source: redeclared here as %q#D
en: 在這裡又被宣告為 %q#D

source: redefined extern inline functions are not considered for inlining
en: 不考慮內聯重定義的外部內聯函式

source: redefinition of %<struct %E%>
en: %<struct %E%> 重定義

source: redefinition of %<union %E%>
en: %<union %E%> 重定義

source: redefinition of %q+D
en: %q+D 重定義

source: redefinition of parameter %q+D
en: 參數 %q+D 重定義

source: redefinition of typedef %q+D
en: %q+D 重定義

source: redundant redeclaration of %q+D
en: 對 %q+D 冗餘的重宣告

source: reference %qs is ambiguous: appears in interface %qs and interface %qs
en: 參照 %qs 有歧義：出現在介面 %qs 和介面 %qs 中

source: reference to %<%T::%D%> is ambiguous
en: 對 %<%T::%D%> 的參照有歧義

source: reference to %qD is ambiguous
en: 對 %qD 的參照有歧義

source: reference to local variable %q+D returned
en: 回傳了對局部變數的 %q+D 的參照

source: reference to non-lvalue returned
en: 回傳了一個非左值的參照

source: register name given for non-register variable %q+D
en: 為非暫存器變數 %q+D 給定了暫存器名

source: register name not specified for %q+D
en: %q+D 的暫存器名無效

source: register specified for %q+D isn%'t suitable for data type
en: 為 %q+D 指定的暫存器不適合此資料類型

source: register variable %qD used in nested function
en: 巢狀函式中使用了暫存器變數 %qD

source: reject %s
en: 拒絕 %s

source: remote folder “{}” not supported
en: 遠端資料夾「{}」不支援

source: rename spec %s to %s
en: 將 spec %s 重新命名為 %s

source: repeated %s in format
en: 格式字串中有重複的 %s

source: request for member %qD in %qE, which is of non-class type %qT
en: 對成員 %qD 的請求出現在 %qE 中，而後者具有非類別類型 %qT

source: request for member %qD is ambiguous in multiple inheritance lattice
en: 在多繼承網格中對 %qD 的存取有歧義

source: request for member %qE in something not a structure or union
en: 在非結構或聯合中請求成員 %qE

source: requested alignment is not a power of 2
en: 要求的對齊邊界不是 2 的某次方

source: requested alignment is too large
en: 要求的對齊邊界太大

source: requested init_priority is not an integer constant
en: 請求的 init_priority 不是一個整數常數

source: requested init_priority is out of range
en: 請求的 init_priority 越界

source: requested init_priority is reserved for internal use
en: 請求的 init_priority 保留為內部使用

source: requested position is less than zero
en: 要求的位置小於 0

source: requested position is not an integer constant
en: 要求的位置不是一個整數常數

source: result of %<operator->()%> yields non-pointer result
en: %<operator->()%> 的結果給出了非指標的結果

source: return from incompatible pointer type
en: 回傳了不相容的指標類型

source: return makes integer from pointer without a cast
en: 回傳時將指標賦給整數，未作類型轉換

source: return makes pointer from integer without a cast
en: 回傳時將整數賦給指標，未作類型轉換

source: return type is an incomplete type
en: 回傳不完全的類型

source: return type might be a candidate for a format attribute
en: 回傳類型可能是 format 屬性的備選

source: return type specification for constructor invalid
en: 為建構式指定回傳值無效

source: return type specification for destructor invalid
en: 指定解構函式的回傳類型無效

source: return type specified for %<operator %T%>
en: 為 %<operator %T%> 指定了回傳值

source: return-statement with a value, in function returning 'void'
en: 在回傳「void」的函式中，回傳敘述帶回傳值

source: return-statement with no value, in function returning %qT
en: 在回傳 %qT 的函式中，回傳敘述不帶回傳值

source: returning a value from a destructor
en: 解構函式回傳值

source: returning reference to temporary
en: 回傳臨時變數的參照

source: right precision
en: 右精度

source: right precision in strfmon format
en: strfmon 格式的右精度

source: right shift count >= width of type
en: 右移次數大於或等於類型寬度

source: right shift count is negative
en: 右移次數為負

source: rounding mode not supported for VAX floats
en: 捨入模式不為 VAX 浮點數所支援

source: running
en: 執行中

source: s390 network device type; one of "qeth", "lcs", or "ctc", representing the different types of virtual network devices available on s390 systems.
en: s390網絡設備類型; “qeth”，“lcs”或“ctc”之一，代表s390系統上可用的不同類型的虛擬網絡設備。

source: save [persistent|temporary] :: save the connection Sends the connection profile to NetworkManager that either will save it persistently, or will only keep it in memory. 'save' without an argument means 'save persistent'. Note that once you save the profile persistently those settings are saved across reboot or restart. Subsequent changes can also be temporary or persistent, but any temporary changes will not persist across reboot or restart. If you want to fully remove the persistent connection, the connection profile must be deleted.
en: save [persistent | temporary] :: save the connection將連接配置文件發送到NetworkManager，它將永久保存，或者只保留在內存中。沒有參數的'save'意味著'保存持久'。請注意，一旦您持久保存配置文件，這些設置將在重新啟動或重新啟動時保存。後續更改也可以是臨時更改或持久更改，但任何臨時更改都不會在重新引導或重新啟動時保留。如果要完全刪除持久連接，則必須刪除連接配置文件。

source: say %<typename %E%> if a type is meant
en: 如果您想指定類型，請使用 %<typename %E%>

source: second argument of %q+D should be %<char **%>
en: %q+D 的第二個參數類型應該是 %<char **%>

source: second argument to %<__builtin_prefetch%> must be a constant
en: %<__builtin_prefetch%> 的第二個引數必須是一個常數

source: second parameter of %<va_start%> not last named argument
en: %<va_start%> 的第二個參數不是最後一個具名參數

source: seconds
en: 秒

source: secret is not of correct type
en: 秘密不是正確的類型

source: secret not found
en: 沒找到秘密

source: secret value was empty
en: 秘密價值是空的

source: selector must be an immediate
en: 選擇子必須是立即數值

source: selector must be an integer constant in the range 0..%wi
en: 選擇子必須是 0 到 %wi 間的整常數

source: set [<setting>.<prop> <value>] :: set property value This command sets property value. Example: nmcli> set con.id My connection
en: set [<setting>.<prop> <value>] :: 設置內容值 這項指令會設置內容的值。 範例：nmcli> set con.id My connection

source: set [<value>] :: set new value This command sets provided <value> to this property
en: set [<value>] :: 設定新的值 這項指令會將提供的 <value> 設置至此內容

source: setting contained a secret with an empty name
en: 設置包含一個空名稱的秘密

source: setting is required for non-slave connections
en: 非從屬連接需要設置

source: setting not found
en: 設置未找到

source: setting this property requires non-zero '%s' property
en: 設定此屬性需要非零值的 '%s' 屬性

source: shadows template parm %q+#D
en: 隱藏了模版參數 %q+#D

source: shared and mdll are not compatible
en: shared 和 mdll 互不相容

source: shared call_stmt:
en: 共享的 call_stmt：

source: shared rtx
en: 共享的 rtx

source: shift
en: Šift

source: simple IF
en: 簡單的 IF

source: size assigned to %qT may not be ABI-compliant and may change in a future version of GCC
en: 賦於 %qT 的大小可能與 ABI 不相容，並且可能在 GCC 的未來版本中變更

source: size in array new must have integral type
en: 陣列 new 的大小必須有整數類型

source: size of %q+D is %d bytes
en: %q+D 的大小為 %d 位元組

source: size of %q+D is larger than %wd bytes
en: %q+D 的大小超過 %wd 位元組

source: size of array %qD has non-integral type %qT
en: 陣列 %qD 的大小具有非整數類型 %qT

source: size of array %qD is negative
en: 陣列 %qD 的大小為負

source: size of array %qD is not an integral constant-expression
en: 陣列 %qD 的大小不是一個整數常運算式

source: size of array %qs is too large
en: 陣列 %qs 太大

source: size of array has non-integral type %qT
en: 陣列 %qT 的大小的類型不是整數

source: size of array is negative
en: 陣列大小為負數

source: size of loop %d should be %d, not %d
en: 循環 %d 的大小應該為 %d，而不是%d

source: size of return value of %q+D is %u bytes
en: %q+D 回傳值的大小為 %u 位元組

source: size of return value of %q+D is larger than %wd bytes
en: %q+D 回傳值的大小為 %wd 位元組

source: sizeof(long double) is 12
en: sizeof(long double) 等於 12

source: sizeof(long double) is 16
en: sizeof(long double) 等於 16

source: skips initialization of %q+#D
en: 略過 %q+#D 的初始化

source: soft-float and long-double-128 are incompatible
en: soft-float 與 long-double-128 互不相容

source: some flags are invalid for the select mode: %s
en: 某些標誌對於選擇模式無效： %s

source: sorry, unimplemented:
en: 對不起，尚未實作：

source: spec failure: more than one arg to SYSROOT_SUFFIX_SPEC
en: spec 失敗：SYSROOT_SUFFIX_SPEC 參數多於一個

source: spec is '%s'
en: spec 是「%s」

source: specialization of %qD after instantiation
en: %qD 的特例化在實體化之後

source: specialization of %qD in different namespace
en: 在不同命名空間內對 %qD 的特例化

source: specialization of implicitly-declared special member function
en: 特例化了隱含宣告的特殊成員函式

source: specializing %q#T in different namespace
en: 在不同命名空間中特例化 %q#T

source: specified mode too small for enumeral values
en: 指定的模式對列舉值來說太小

source: specifying vector types with __attribute__ ((mode)) is deprecated
en: 指定向量類型時使用 __attribute__ ((mode)) 已過時

source: specs %%include syntax malformed after %ld characters
en: specs %%include 在 %ld 字元後語法格式錯誤

source: specs %%rename syntax malformed after %ld characters
en: specs %%rename 在 %ld 字元後語法格式錯誤

source: specs file malformed after %ld characters
en: specs 在 %ld 字元後檔案格式錯誤

source: specs unknown %% command after %ld characters
en: specs 在 %ld 字元後出現不明的 %% 命令

source: spurious trailing %<%%%> in format
en: 格式字串尾有可疑的 %<%%%>

source: stack frame not a multiple of 8 bytes: %wd
en: 堆疊框架大小不是 8 位元組的倍數：%wd

source: stack frame not a multiple of octabyte: %wd
en: 堆疊框架大小不是 8 位元組的倍數：%wd

source: stack frame too large
en: 堆疊框架太大

source: stack guard value must be an exact power of 2
en: 堆疊防護值必須是 2 的整數次方

source: stack limits not supported on this target
en: 堆疊限制在此目標平臺上不受支援

source: stack size must be greater than the stack guard value
en: 堆疊大小必須大於堆疊防護值

source: stack size must not be greater than 64k
en: 堆疊大小不能大於 64K

source: stack underflow - dup* operation
en: 堆疊向下溢位 - dup* 作業

source: stackframe too big: %d bytes
en: 堆疊框架太大：%d 位元組

source: started
en: 已開始

source: starting
en: 正在開始

source: statement with no effect
en: 敘述不起作用

source: static %qs cannot be declared %<mutable%>
en: 靜態 %qs 不能被宣告為 %<mutable%>

source: static declaration of %q+D follows non-static declaration
en: 對 %qD 的靜態宣告出現在非靜態宣告之後

source: static is not supported on TPF-OS
en: TPF-OS 不支援 static

source: static member %qD declared %<register%>
en: 靜態成員 %qD 宣告為 %<register%>

source: static member function %q#D declared with type qualifiers
en: 靜態成員函式 %q#D 的宣告帶有類型限定符

source: stdcall and cdecl attributes are not compatible
en: stdcall 和 cdecl 屬性互不相容

source: storage class %<auto%> invalid for function %qs
en: 函式 %qs 的存儲類別 %<auto%> 無效

source: storage class %<register%> invalid for function %qs
en: 函式 %qs 的存儲類別 %<register%> 無效

source: storage class specified for %qs
en: 為 %qs 指定了存儲類別

source: storage class specified for parameter %qs
en: 為參數 %qs 指定了存儲類別

source: storage class specifiers invalid in friend function declarations
en: 為夥伴函式宣告指定了無效的存儲類別

source: storage size of %q+D isn%'t constant
en: %q+D 的存儲大小不是常數

source: storage size of %q+D isn%'t known
en: %q+D 的存儲大小不明

source: stray %<\%o%> in program
en: 程式中有游離的 %<\%o%>

source: stray %qc in program
en: 程式中有游離的 %qc

source: stray %qs in program
en: 程式中有游離的 %qs

source: strftime formats cannot format arguments
en: strftime 格式字串無法格式化引數

source: string length %qd is greater than the length %qd ISO C%d compilers are required to support
en: 字串長 %qd 比 %qd (ISO C%d 被要求支援的最大長度) 還要長

source: strong-cast assignment has been intercepted
en: 強轉換的賦值被打斷

source: strong-cast may possibly be needed
en: 可能需要強類型轉換

source: struct has no named members
en: 結構不包含任何具名成員

source: subscript missing in array reference
en: 陣列參照缺少下標

source: subscripted value is neither array nor pointer
en: 下標運算的左運算元既非陣列也非指標

source: subscripting array declared %<register%>
en: 按下標存取宣告為 %<register%> 的陣列

source: suggest parentheses around assignment used as truth value
en: 建議在做為真值的賦值敘述前後加上括號

source: sum not 100%
en: 總和不是 100%

source: support for mode %qs
en: 支援 %qs 模式

source: switch %qs is no longer supported
en: 開關 %qs 不再被支援

source: switch quantity not an integer
en: switch 敘述中的值不是一個整數

source: switch statement of size %lu entries too large
en: switch 敘述太大(%lu 個條目)

source: taking the address of a label is non-standard
en: 取標籤的位址不符合標準

source: target CPU does not support THUMB instructions
en: 目的 CPU 不支援 THUMB 指令

source: target CPU does not support interworking
en: 目的 CPU 不支援交互工作

source: target format does not support infinity
en: 目的格式不支援無限大浮點數

source: target system does not support debug output
en: 目的系統不支援除錯輸出

source: target system does not support the "%s" debug format
en: 目的系統不支援「%s」除錯格式

source: team config exceeds size limit
en: 團隊配置超出大小限制

source: team config file '%s' contains non-valid utf-8
en: 團隊配置文件'%s' 包含無效的utf-8

source: teamd control failed
en: teamd 控制失敗

source: template argument required for %<%s %T%>
en: %<%s %T%> 需要範本參數

source: template class without a name
en: 範本類別沒具名字

source: template declaration of %q#D
en: %q#D 宣告為範本

source: template definition of non-template %q#D
en: 對非範本 %q#D 的範本定義

source: template header not allowed in member definition of explicitly specialized class
en: 範本頭不允許出現在明確特例化類別的成員定義中

source: template parameter %q+#D
en: 範本參數 %q+#D

source: template parameter %qD of type %qT is not allowed in an integral constant expression because it is not of integral or enumeration type
en: 範本參數 %qD(類型為 %qT)不允許出現在整數運算式中，因為它的類型不是整數或列舉

source: template parameter list used in explicit instantiation
en: 明確初始化中出現了範本參數清單

source: template parameter type %qT declared %<friend%>
en: 範本參數類型 %qT 宣告為 %<friend%>

source: template parameters cannot be friends
en: 範本參數不能是夥伴

source: template parameters do not match template
en: 範本參數與範本不符

source: template parameters not used in partial specialization:
en: 部分特例化中未用到範本參數：

source: template type parameters must use the keyword %<class%> or %<typename%>
en: 範本參數必須使用 %<class%> 或 %<typename%> 關鍵字

source: template-id %qD for %q+D does not match any template declaration
en: 範本識別碼 %qD(屬於 %q+D)不匹配任何範本宣告

source: template-id %qD in declaration of primary template
en: 範本識別碼 %qD 出現在基本範本的宣告中

source: template-id %qD used as a declarator
en: 範本識別碼 %qD 做為宣告

source: the ' ' printf flag
en: 「 」printf 旗標

source: the '!' strfmon flag
en: 「!」strfmon 旗標

source: the '#' printf flag
en: 「#」printf 旗標

source: the '#' strftime flag
en: 「#」strftime 旗標

source: the ''' printf flag
en: 「'」printf 旗標

source: the ''' scanf flag
en: 「'」scanf 旗標

source: the '(' strfmon flag
en: 「(」strfmon 旗標

source: the '+' printf flag
en: 「+」printf 旗標

source: the '+' strfmon flag
en: 「+」strfmon 旗標

source: the '-' printf flag
en: 「-」printf 旗標

source: the '-' strfmon flag
en: 「-」strfmon 旗標

source: the '-' strftime flag
en: 「-」strftime 旗標

source: the '0' printf flag
en: 「0」printf 旗標

source: the '0' strftime flag
en: 「0」strftime 旗標

source: the 'E' strftime modifier
en: 「E」strftime 修飾符

source: the 'I' printf flag
en: 「I」printf 旗標

source: the 'I' scanf flag
en: 「I」scanf 旗標

source: the 'O' modifier
en: 「O」修飾符

source: the 'O' strftime modifier
en: 「O」strftime 修飾符

source: the '^' strfmon flag
en: 「^」strfmon 旗標

source: the '^' strftime flag
en: 「^」strftime 旗標

source: the '_' strftime flag
en: 「_」strftime 旗標

source: the 'q' diagnostic flag
en: 「q」診斷旗標

source: the assignment suppression scanf feature
en: scanf 的取消賦值特性

source: the key is empty
en: 關鍵是空的

source: the key must be %d characters
en: 關鍵必須是 %d 人物

source: the m210 does not have little endian support
en: m210 不支援低位位元組在前

source: the mangled name of %qD will change in a future version of GCC
en: %qD 修飾後的名稱將在 GCC 的未來版本中有變化

source: the mask can't contain bits 0 (STP), 1 (MAC) or 2 (LACP)
en: 掩碼不能包含位0（STP），1（MAC）或2（LACP）

source: the metric ('%s') must be before attributes
en: 指標（'%s') 必須在屬性之前

source: the next hop ('%s') must be first
en: 下一跳（'%s') 必須是第一個

source: the offset of %qD may not be ABI-compliant and may change in a future version of GCC
en: %qD 的偏移量可能與 ABI 不相容，並且可能在 GCC 的未來版本中變更

source: the plugin does not support export capability
en: 該插件不支持導出功能

source: the plugin does not support import capability
en: 該插件不支持導入功能

source: the property can't be changed
en: 內容不可更改

source: the script is not valid utf8
en: 該腳本無效utf8

source: the script is too large
en: 腳本太大了

source: the script lacks FindProxyForURL function
en: 該腳本缺少FindProxyForURL函數

source: the tag id must be in range 0-4094 but is %u
en: 標籤ID必須在0-4094範圍內，但是 %u

source: the type being destroyed is %qT, but the destructor refers to %qT
en: 被解構的類型是 %qT，但解構函式卻使用了 %qT

source: the vlan id must be in range 0-4094 but is %u
en: vlan id必須在0-4094範圍內，但是 %u

source: there are duplicate TC filters
en: 有重複的TC過濾器

source: there are duplicate TC qdiscs
en: 有重複的TC qdiscs

source: there are no arguments to %qD that depend on a template parameter, so a declaration of %qD must be available
en: %qD 的引數不依賴範本參數，所以 %qD 的宣告必須可用

source: there exists a conflicting plugin (%s) that has the same %s.%s value
en: 存在衝突的插件（%s) 有相同的 %s.%s 值

source: there exists a conflicting plugin with the same name (%s)
en: 存在一個具有相同名稱的衝突插件（%s)

source: third argument of %q+D should probably be %<char **%>
en: %q+D 如果有第三個參數，類型應該是 %<char **%>

source: third argument to %<__builtin_prefetch%> must be a constant
en: %<__builtin_prefetch%> 的第三個引數必須是一個常數

source: this builtin function is only available on the fr405 and fr450
en: 此內建函式只在 fr405 和 fr450 上可用

source: this builtin function is only available on the fr450
en: 此內建函式只在 fr450 上可用

source: this builtin function is only available on the fr500 and fr550
en: 此內建函式只在 fr500 和 fr550 上可用

source: this decimal constant is unsigned only in ISO C90
en: 這個小數常數僅 ISO C90 中是無號的
